storage/tests/5696a319-09a4-4559-bc50-5724b0635be6/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/5696a319-09a4-4559-bc50-5724b0635be6/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

running (11.0s), 09/10 VUs, 1 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (12.0s), 08/10 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (13.0s), 05/10 VUs, 5 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (14.0s), 04/10 VUs, 6 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......: 50     3.338837/s
    checks_succeeded...: 80.00% 40 out of 50
    checks_failed......: 20.00% 10 out of 50

    ✗ status ok
      ↳  80% — ✓ 40 / ✗ 10

    HTTP
    http_req_duration..............: avg=190.02ms min=4.28ms med=9.38ms max=990.31ms p(90)=668.33ms p(95)=769.95ms
      { expected_response:true }...: avg=80.66ms  min=4.28ms med=8.2ms  max=327.74ms p(90)=309.78ms p(95)=324.43ms
    http_req_failed................: 20.00% 10 out of 50
    http_reqs......................: 50     3.338837/s

    EXECUTION
    iteration_duration.............: avg=13.1s    min=10.92s med=12.99s max=14.97s   p(90)=14.82s   p(95)=14.89s  
    iterations.....................: 10     0.667767/s
    vus............................: 4      min=4        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 26 kB  1.7 kB/s
    data_sent......................: 15 kB  1000 B/s



running (15.0s), 00/10 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s